Autodesk.Revit.DB.BuildingType
This enumeration is used for specifying the most predominant building use type.
Remarks:
This enumerated list corresponds to the buildingType attribute in the gbXML (Green Building XML) schema
and is primarily used for energy analysis.